<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"7d0461b35dbaff784fdb3751af30cac78a822a38af1144f0783d46003387d4a8","plan_job_ref":"Job Create Terraform plan (DEV) #156 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15139494221","plan_out_hash":"39051fb06a531a1ef7d76b1abba3a9d1fed837574753036c1be10272f4261cda","plan_hash":"b42cf98914f92199a5d2b744918aa3fcfdb97ae4b8540ae5bf0934a601ccc40b","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.openmrs is tainted, so must be replaced
-/+ resource "helm_release" "openmrs" {
!~      id                         = "*******" -> (known after apply)
+       manifest                   = (known after apply)
!~      metadata                   = [
-           {
-               app_version    = "3.1.0"
-               chart          = "openmrs"
-               first_deployed = 1747747166
-               last_deployed  = 1747747166
-               name           = "openmrs"
-               namespace      = "openmrs"
-               notes          = <<-EOT
                    OpenMRS Gateway has been successfully deployed!
                    
                    Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace openmrs -l "app.kubernetes.io/name=openmrs-gateway,app.kubernetes.io/instance=openmrs" -o jsonpath="{.items[0].metadata.name}")
                      export CONTAINER_PORT=$(kubectl get pod --namespace openmrs $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                      echo "Visit http://127.0.0.1:8080 to use your application"
                      kubectl --namespace openmrs port-forward $POD_NAME 8080:$CONTAINER_PORT
                    
                    OpenMRS has been successfully deployed!
                    
                    It may take a few minutes for the OpenMRS application to be accessible. You can watch the status by running
                    and waiting for all pods to be ready:
                    
                    kubectl get pods --namespace openmrs
                    
                    Get the application URL by running these commands:
                      export NODE_PORT=$(kubectl get --namespace openmrs -o jsonpath="{.spec.ports[0].nodePort}" services openmrs)
                      export NODE_IP=$(kubectl get nodes --namespace openmrs -o jsonpath="{.items[0].status.addresses[0].address}")
                      echo http://$NODE_IP:$NODE_PORT
                    
                    OpenMRS Backend has been successfully deployed!
                    
                    Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace openmrs -l "app.kubernetes.io/name=openmrs-backend,app.kubernetes.io/instance=openmrs" -o jsonpath="{.items[0].metadata.name}")
                      export CONTAINER_PORT=$(kubectl get pod --namespace openmrs $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                      echo "Visit http://127.0.0.1:8080 to use your application"
                      kubectl --namespace openmrs port-forward $POD_NAME 8080:$CONTAINER_PORT
                    
                    CHART NAME: mariadb
                    CHART VERSION: 19.0.5
                    APP VERSION: 11.4.3
                    
                    ** Please be patient while the chart is being deployed **
                    
                    Tip:
                    
                      Watch the deployment status using the command: kubectl get pods -w --namespace openmrs -l app.kubernetes.io/instance=openmrs
                    
                    Services:
                    
                      echo Primary: openmrs-mariadb-primary.openmrs.svc.cluster.local:3306
                      echo Secondary: openmrs-mariadb-secondary.openmrs.svc.cluster.local:3306
                    
                    Administrator credentials:
                    
                      Username: root
                      Password : $(kubectl get secret --namespace openmrs openmrs-mariadb -o jsonpath="{.data.mariadb-root-password}" | base64 -d)
                    
                    To connect to your database:
                    
                      1. Run a pod that you can use as a client:
                    
                          kubectl run openmrs-mariadb-client --rm --tty -i --restart='Never' --image  docker.io/bitnami/mariadb:10.11 --namespace openmrs --command -- bash
                    
                      2. To connect to primary service (read/write):
                    
                          mysql -h openmrs-mariadb-primary.openmrs.svc.cluster.local -uroot -p openmrs
                    
                      3. To connect to secondary service (read-only):
                    
                          mysql -h openmrs-mariadb-secondary.openmrs.svc.cluster.local -uroot -p openmrs
                    
                    To upgrade this helm chart:
                    
                      1. Obtain the password as described on the 'Administrator credentials' section and set the 'auth.rootPassword' parameter as shown below:
                    
                          ROOT_PASSWORD=$(kubectl get secret --namespace openmrs openmrs-mariadb -o jsonpath="{.data.mariadb-root-password}" | base64 -d)
                          helm upgrade --namespace openmrs openmrs oci://registry-1.docker.io/bitnamicharts/mariadb --set auth.rootPassword=$ROOT_PASSWORD
                    WARNING: Rolling tag detected (bitnami/mariadb:10.11), please note that it is strongly recommended to avoid using rolling tags in a production environment.
                    +info https://docs.vmware.com/en/VMware-Tanzu-Application-Catalog/services/tutorials/GUID-understand-rolling-tags-containers-index.html
                    
                    WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                      - primary.resources
                      - secondary.resources
                    +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                    
                    ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                    
                    Substituted images detected:
                      - docker.io/bitnami/mariadb:%!s(float64=10.11)
                    OpenMRS Frontend has been successfully deployed!
                    
                    Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace openmrs -l "app.kubernetes.io/name=openmrs-frontend,app.kubernetes.io/instance=openmrs" -o jsonpath="{.items[0].metadata.name}")
                      export CONTAINER_PORT=$(kubectl get pod --namespace openmrs $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                      echo "Visit http://127.0.0.1:8080 to use your application"
                      kubectl --namespace openmrs port-forward $POD_NAME 8080:$CONTAINER_PORT
                EOT
-               revision       = 1
-               values         = jsonencode(
                    {
-                       global           = {
-                           defaultStorageClass = "default"
                        }
-                       openmrs-backend  = {
-                           image = {
-                               repository = "openmrsdevacr.azurecr.io/openmrscore-backend"
-                               tag        = "latest"
                            }
                        }
-                       openmrs-frontend = {
-                           image = {
-                               repository = "openmrsdevacr.azurecr.io/openmrscore-frontend"
-                               tag        = "latest"
                            }
                        }
-                       openmrs-gateway  = {
-                           image   = {
-                               repository = "openmrsdevacr.azurecr.io/openmrscore-gateway"
-                               tag        = "latest"
                            }
-                           service = {
-                               port = 80
-                               type = "ClusterIP"
                            }
                        }
                    }
                )
-               version        = "0.1.5"
            },
        ] -> (known after apply)
        name                       = "openmrs"
!~      status                     = "failed" -> "deployed"
!~      values                     = [
!~          <<-EOT
                ---
                # Global settings
                global:
                  defaultStorageClass: "default"
                
                # OpenMRS Backend settings
                openmrs-backend:
                  image:
                    tag: "latest"
              -     repository: "openmrsdevacr.azurecr.io/openmrscore-backend"
              +     repository: "openmrsacrdev.azurecr.io/openmrscore-backend"
                
                # OpenMRS Frontend settings
                openmrs-frontend:
                  image:
                    tag: "latest"
              -     repository: "openmrsdevacr.azurecr.io/openmrscore-frontend"
              +     repository: "openmrsacrdev.azurecr.io/openmrscore-frontend"
                
                # OpenMRS Gateway settings
                openmrs-gateway:
                  image:
                    tag: "latest"
              -     repository: "openmrsdevacr.azurecr.io/openmrscore-gateway"
              +     repository: "openmrsacrdev.azurecr.io/openmrscore-gateway"
                
                  service:
                    type: ClusterIP
                    port: 80
            EOT,
        ]
#        (25 unchanged attributes hidden)
    }

  # kubectl_manifest.openmrs_ingress will be created
+   resource "kubectl_manifest" "openmrs_ingress" {
+       api_version             = "networking.k8s.io/v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Ingress"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "openmrs-gateway-ingress"
+       namespace               = "openmrs"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: Ingress
            metadata:
              annotations:
                cert-manager.io/cluster-issuer: letsencrypt-prod
                nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
              name: openmrs-gateway-ingress
              namespace: openmrs
            spec:
              ingressClassName: webapprouting.kubernetes.azure.com
              rules:
              - host: openmrs.dev.audioprothese.ovh
                http:
                  paths:
                  - backend:
                      service:
                        name: gateway
                        port:
                          number: 80
                    path: /
                    pathType: Prefix
              tls:
              - hosts:
                - openmrs.dev.audioprothese.ovh
                secretName: openmrs-tls
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #156](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15139494221)